angular.module('llt.app')
    .constant('LITERATURE_4', [
      {
        question: 'Розв’язкою комедії "Мина Мазайло" Миколи Куліша є',
        answers: [
          {
            text: 'приїзд до Харкова тьоті Моті'
          },
          {
            text: 'зміна прізвища Миною Мазайлом'
          },
          {
            text: 'примирення Мини Мазайла з Мокієм'
          },
          {
            text: 'промова дядька Тараса'
          },
          {
            text: 'звільнення Мини Мазайла з роботи',
            correct: true
          }
        ]
      },
      {
        question: 'Уривок <span class="italic-inline">"З розвитком рибальства сом важитиме тонну і ковтатиме симентальських бугаїв і невеличкі буксирні пароплави... А сома... мені самому доводилося бачити такого завбільшки, як комбайн"</span> є прикладом',
        answers: [
          {
            text: 'сарказму'
          },
          {
            text: 'сатири'
          },
          {
            text: 'травестії'
          },
          {
            text: 'бурлеску'
          },
          {
            text: 'іронії',
            correct: true
          }
        ]
      },
      {
        question: '<span class="italic-inline">"Вона ж була як голос України, що клекотів у наших корогвах!"</span> – так схарактеризовано головну героїню твору',
        answers: [
          {
            text: 'Лесі Українки'
          },
          {
            text: 'Ліни Костенко',
            correct: true
          },
          {
            text: 'Івана Франка'
          },
          {
            text: 'Тараса Шевченка'
          },
          {
            text: 'Андрія Малишка'
          }
        ]
      },
      {
        question: 'Представником Празької школи був автор твору',
        answers: [
          {
            text: '"Різдво"'
          },
          {
            text: '"Молюсь і вірю"'
          },
          {
            text: '"О панно Інно"'
          },
          {
            text: '"Стилет чи стилос?"',
            correct: true
          },
          {
            text: '"Любіть Україну"'
          }
        ]
      },
      {
        question: '<span class="italic-inline">"Ця дівчина не просто так, Маруся. / Це – голос наш. Це – пісня. Це – душа"</span> – сказано про героїню',
        answers: [
          {
            text: 'думи'
          },
          {
            text: 'поеми'
          },
          {
            text: 'драми'
          },
          {
            text: 'роману у віршах',
            correct: true
          },
          {
            text: 'пригодницького роману'
          }
        ]
      },
      {
        question: '<span class="italic-inline">"Стилет чи стилос? – не збагнув. Двояко / Вагаються трагічні терези",</span> – пише у своєму творі',
        answers: [
          {
            text: 'Василь Стус'
          },
          {
            text: 'Іван Драч'
          },
          {
            text: 'Андрій Малишко'
          },
          {
            text: 'Євген Маланюк',
            correct: true
          },
          {
            text: 'Богдан-Ігор Антонич'
          }
        ]
      },
      {
        question: 'Ю. Андрухович, В. Неборак і О. Ірванець заснували поетичне угруповання',
        answers: [
          {
            text: '"Пропала грамота"'
          },
          {
            text: '"Бу-Ба-Бу"',
            correct: true
          },
          {
            text: '"Нова дегенерація"'
          },
          {
            text: '"ЛуГоСад"'
          },
          {
            text: '"Західний вітер"'
          }
        ]
      },
      {
        question: 'Наум Дрот є одним із центральних персонажів твору',
        answers: [
          {
            text: 'Івана Карпенка-Карого'
          },
          {
            text: 'Пантелеймона Куліша'
          },
          {
            text: 'Івана Котляревського'
          },
          {
            text: 'Марка Вовчка'
          },
          {
            text: 'Григорія Квітки-Основ’яненка',
            correct: true
          }
        ]
      },
      {
        question: '<span class="italic-inline">"Зі своїм запорозьким бурлацтвом він самовільно влетів у метушливий світ олімпійських маскарадів, його сміх розітнувся голосною луною"</span>, – сказав Євген Сверстюк про',
        answers: [
          {
            text: 'Тараса Шевченка'
          },
          {
            text: 'Пантелеймона Куліша'
          },
          {
            text: 'Івана Котляревського',
            correct: true
          },
          {
            text: 'Івана Франка'
          },
          {
            text: 'Григорія Квітку-Основ’яненка'
          }
        ]
      },
      {
        question: '<span class="italic-inline">"Чи я вам рівня? Ви пан, а я сирота; ви багатий, а я бідна; та й по всьому я вам не під пару"</span>, – відмовляється від залицянь заможного посадовця головна героїня твору',
        answers: [
          {
            text: 'Тараса Шевченка'
          },
          {
            text: 'Лесі Українки'
          },
          {
            text: 'Ліни Костенко'
          },
          {
            text: 'Івана Франка'
          },
          {
            text: 'Івана Котляревського',
            correct: true
          }
        ]
      },
      {
        question: 'Із закликом<br/><span class="italic-inline">Обніміться ж, брати мої.<br/>Молю вас, благаю!<br/></span> до українців звернувся',
        answers: [
          {
            text: 'Тарас Шевченко',
            correct: true
          },
          {
            text: 'Іван Котляревський'
          },
          {
            text: 'Григорій Сковорода'
          },
          {
            text: 'Іван Франко'
          },
          {
            text: 'Олександр Олесь'
          }
        ]
      },
      {
        question: 'У Чигирині, Лисянці, Лебедині, Умані відбуваються події твору',
        answers: [
          {
            text: '"Кайдашева сім’я"'
          },
          {
            text: '"Мартин Боруля"'
          },
          {
            text: '"Гайдамаки"',
            correct: true
          },
          {
            text: '"Хіба ревуть воли, як ясла повні?"'
          },
          {
            text: '"Чорна рада"'
          }
        ]
      }
    ]);
