angular.module('llt.app')
    .constant('LITERATURE_2', [
      {
        question: 'У рядках <br/><br/><em class="center-align">Всякому місту – звичай і права,<br/>Всяка тримає свій ум голова;<br/>Всякому серцю – любов і тепло,<br/>Всякеє горло свій смак віднайшло</em><br/><br/> вжито',
        answers: [
          {
            text: 'інверсію'
          },
          {
            text: 'антитезу'
          },
          {
            text: 'анафору',
            correct: true
          },
          {
            text: 'асонанс'
          },
          {
            text: 'алітерацію'
          }
        ]
      },
      {
        question: '<em>"Красива, розумна, моторна і до всякого діла дотепна, – яке в неї добре серце, як вонаповажає матір свою; шанує всіх старших себе; яка трудяща, яка рукодільниця"</em> – так схарактеризовано героїню твору',
        answers: [
          {
            text: '"Мартин Боруля"'
          },
          {
            text: '"Чорна рада"'
          },
          {
            text: '"Максим Гримач"'
          },
          {
            text: '"Земля"'
          },
          {
            text: '"Наталка Полтавка"',
            correct: true
          }
        ]
      },
      {
        question: '<em>"В своїй хаті своя й правда, і сила, і воля"</em>, – стверджує в своєму творі',
        answers: [
          {
            text: 'Григорій Сковорода'
          },
          {
            text: 'Іван Котляревський'
          },
          {
            text: 'Тарас Шевченко',
            correct: true
          },
          {
            text: 'Леся Українка'
          },
          {
            text: 'Іван Франко'
          }
        ]
      },
      {
        question: '<em>"Чоловічок сей був у короткій старенькій свитині, у полотняних штанях, чоботи шкапові, попротоптувані – і пучки видно. Хіба по шаблі можна б догадуватися, що воно щось не просте: шабля аж горіла од золота; да й та на йому була мов чужа. І постать, і врода в його була зовсім не гетьманська"</em>, – це портрет',
        answers: [
          {
            text: 'Кирила Тура'
          },
          {
            text: 'Івана Шрама'
          },
          {
            text: 'Якима Сомка'
          },
          {
            text: 'Матвія Гвинтовки'
          },
          {
            text: 'Івана Брюховецького',
            correct: true
          }
        ]
      },
      {
        question: 'В Україні під заголовком "Пропаща сила" опубліковано твір',
        answers: [
          {
            text: '"Хазяїн"'
          },
          {
            text: '"Хіба ревуть воли, як ясла повні?"',
            correct: true
          },
          {
            text: '"Людина"'
          },
          {
            text: '"Тіні забутих предків"'
          },
          {
            text: '"Камінний хрест"'
          }
        ]
      },
      {
        question: 'Рядки <br/><br/><em>Являйся, зіронько, мені!<br/>Хоч в сні!</em><br/><br/>є в творі',
        answers: [
          {
            text: 'Тараса Шевченка'
          },
          {
            text: 'Івана Франка',
            correct: true
          },
          {
            text: 'Івана Котляревського'
          },
          {
            text: 'Ліни Костенко'
          },
          {
            text: 'Лесі Українки'
          }
        ]
      },
      {
        question: 'Головним героєм твору "Камінний хрест" є',
        answers: [
          {
            text: 'Іван Дідух',
            correct: true
          },
          {
            text: 'Гнат Кухарчук'
          },
          {
            text: 'Іван Палійчук'
          },
          {
            text: 'Терентій Пузир'
          },
          {
            text: 'Нечипор Вареник'
          }
        ]
      },
      {
        question: 'Стилістичний засіб, який Остап Вишня використав у назві гуморески "Моя автобіографія"',
        answers: [
          {
            text: 'оксиморон'
          },
          {
            text: 'тавтологія',
            correct: true
          },
          {
            text: 'паралелізм'
          },
          {
            text: 'антитеза'
          },
          {
            text: 'алюзія'
          }
        ]
      },
      {
        question: '<em>"Ти вже не згинеш, ти двожилава,<br/>Земля, рабована віками,<br/>І не скарать тебе душителям<br/>Сибірами і соловками",</em> – звертається до України',
        answers: [
          {
            text: 'Ліна Костенко'
          },
          {
            text: 'Леся Українка'
          },
          {
            text: 'Василь Стус',
            correct: true
          },
          {
            text: 'Євген Маланюк'
          },
          {
            text: 'Іван Драч'
          }
        ]
      },
      {
        question: 'Прочитайте поезію Івана Франка та виконайте завдання. <br/><br/><em>Як почуєш вночі край свойого вікна,<br/>Що щось плаче і хлипає важко,<br/>Не тривожся зовсім, не збавляй собі сна.<br/>Не дивися в той бік, моя пташко!<br/><br/>Се не та сирота, що без мами блука,<br/>Се розпука моя, невтишима тоска,<br/>Се любов моя плаче так гірко</em><br/><br/>У творі використано',
        answers: [
          {
            text: 'паралельне римування'
          },
          {
            text: 'перехресне римування',
            correct: true
          },
          {
            text: 'кільцеве римування'
          },
          {
            text: 'білий вірш'
          },
          {
            text: 'монориму'
          }
        ]
      },
      {
        question: 'Установіть відповідність між присвятою та назвою твору.',
        table_titles: [
          {
            title: 'Присвята'
          },
          {
            title: 'Назва твору'
          }
        ],
        table: [
          [
            {
              'column': 'Любові всевишній'
            },
            {
              'column': 'Я (Романтика)'
            }
          ],
          [
            {
              'column': 'Кононівським полям'
            },
            {
              'column': 'Кавказ'
            }
          ],
          [
            {
              'column': 'Цвітові яблуні'
            },
            {
              'column': 'Інтермеццо'
            }
          ],
          [
            {
              'column': 'Искреннему моему Якову де Бальмену'
            },
            {
              'column': 'Катерина'
            }
          ],
          [
            {
              'column': ''
            },
            {
              'column': 'Три зозулі з поклоном'
            }
          ]
        ],
        answers: [
          {
            text: '1',
            correct: '5'
          },
          {
            text: '2',
            correct: '3'
          },
          {
            text: '3',
            correct: '1'
          },
          {
            text: '4',
            correct: '2'
          }
        ]
      },
      {
        question: 'Рядки <br/><br/><em>Радуйся, ой радуйся, земле –<br/>Син Божий народився</em><br/><br/> узяті з твору, що належить до',
        answers: [
          {
            text: 'календарно-обрядових пісень',
            correct: true
          },
          {
            text: 'родинно-побутових пісень'
          },
          {
            text: 'соціально-побутових пісень'
          },
          {
            text: 'балад'
          },
          {
            text: 'історичних пісень'
          }
        ]
      }
    ]);
