angular.module('llt.app')
    .constant('LITERATURE_5', [
      {
        question: 'Персонажа давньогрецької міфології, зображеного на малюнку, згадано у творі',
        img: 'src/img/prometheus.png',
        answers: [
          {
            text: '"Кавказ"',
            correct: true
          },
          {
            text: '"Земля"'
          },
          {
            text: '"Contra spem spero!"'
          },
          {
            text: '"Intermezzo"'
          },
          {
            text: '"De libertate"'
          }
        ]
      },
      {
        question: 'Кульмінацією роману Пантелеймона Куліша "Чорна рада" є',
        answers: [
          {
            text: 'викрадення Лесі'
          },
          {
            text: 'вибори гетьмана',
            correct: true
          },
          {
            text: 'похорон війтенка'
          },
          {
            text: 'поразка Сомка'
          },
          {
            text: 'страта полковника Шрама'
          }
        ]
      },
      {
        question: 'В уривку твору "Чорна рада" <span class="italic-inline">"Був він сином паволоцького попа, по прізвищу Чепурного, учився в Київській братській школі, і вже сам вийшов був на попи. Як же піднялись козаки з гетьманом Остряницею, то і він устряв до козацького війська"</span> йдеться про',
        answers: [
          {
            text: 'Брюховецького'
          },
          {
            text: 'Шрама',
            correct: true
          },
          {
            text: 'Сомка'
          },
          {
            text: 'Череваня'
          },
          {
            text: 'Гвинтовку'
          }
        ]
      },
      {
        question: 'Іван Білик закликав створити "народний роман на основі щирого реалізму"',
        answers: [
          {
            text: 'Григорія Квітку-Основ’яненка'
          },
          {
            text: 'Івана Нечуя-Левицького'
          },
          {
            text: 'Панаса Мирного',
            correct: true
          },
          {
            text: 'Ольгу Кобилянську'
          },
          {
            text: 'Василя Стефаника'
          }
        ]
      },
      {
        question: '"Польовою царівною" названо',
        answers: [
          {
            text: 'Лесю Череванівну ("Чорна рада")'
          },
          {
            text: 'Мотрю Довбиш ("Кайдашева сім’я")'
          },
          {
            text: 'Галю Ґудзь ("Хіба ревуть воли, як ясла повні?")',
            correct: true
          },
          {
            text: 'Олену Ляуфлер ("Людина")'
          },
          {
            text: 'Марічку Гутенюк ("Тіні забутих предків")'
          }
        ]
      },
      {
        question: 'Карпо Адамович Тобілевич був прототипом головного героя твору',
        answers: [
          {
            text: '"Максим Гримач"'
          },
          {
            text: '"Кайдашева сім’я"'
          },
          {
            text: '"Камінний хрест"'
          },
          {
            text: '"Мартин Боруля"',
            correct: true
          },
          {
            text: '"Чорна рада"'
          }
        ]
      },
      {
        question: 'Василь Стефаник започаткував в українській літературі стильову течію',
        answers: [
          {
            text: 'імпресіонізму'
          },
          {
            text: 'сентименталізму'
          },
          {
            text: 'романтизму'
          },
          {
            text: 'експресіонізму',
            correct: true
          },
          {
            text: 'реалізму'
          }
        ]
      },
      {
        question: 'Він <span class="italic-inline">"ходив усе зібганий у поясі, а люди прозвали його Переломаний"</span> – сказано про персонажа',
        answers: [
          {
            text: 'комедії'
          },
          {
            text: 'балади'
          },
          {
            text: 'драми'
          },
          {
            text: 'новели',
            correct: true
          },
          {
            text: 'роману'
          }
        ]
      },
      {
        question: '<span class="italic-inline">"…Тут кривавого вина недостало; тут пир докінчили хоробрі русичі…"</span>, – так у "Слові про похід Ігорів" зображено',
        answers: [
          {
            text: 'бенкет у князя Святослава'
          },
          {
            text: 'весілля князя Ігоря та Ярославни'
          },
          {
            text: 'епізод князівських міжусобиць'
          },
          {
            text: 'поразку Ігоря в бою з половцями',
            correct: true
          },
          {
            text: 'святкування повернення Ігоря з половецького полону'
          }
        ]
      },
      {
        question: '<span class="italic-inline">"Батьком української повісті"</span> називають',
        answers: [
          {
            text: 'Івана Котляревського'
          },
          {
            text: 'Григорія Квітку-Основ’яненка',
            correct: true
          },
          {
            text: 'Пантелеймона Куліша'
          },
          {
            text: 'Панаса Мирного'
          },
          {
            text: 'Михайла Коцюбинського'
          }
        ]
      },
      {
        question: 'Установіть відповідність між персонажами того самого твору.',
        table: true,
        table_titles: [
          {
            title_1: 'Персонаж',
          },
          {
            title_2: 'Персонаж'
          }
        ],
        variants_1: [
          {
            text: 'Гриць Бобренко'
          },
          {
            text: 'Антоніо Пальма'
          },
          {
            text: 'Григорій Многогрішний'
          },
          {
            text: 'Мокій Мазайло'
          },
          {
            text: ''
          }
        ],
        variants_2: [
          {
            text: 'Марфа Яркова'
          },
          {
            text: 'Уля Розсоха'
          },
          {
            text: 'Христя Хуторна'
          },
          {
            text: 'Наталка Сірко'
          },
          {
            text: 'Галя Вишняк'
          }
        ],
        answers: [
          {
            text: '1',
            correct: 'e'
          },
          {
            text: '2',
            correct: 'c'
          },
          {
            text: '3',
            correct: 'd'
          },
          {
            text: '4',
            correct: 'b'
          }
        ]
      },
      {
        question: 'Правнук гетьмана Запорозької Січі Дем’яна Многогрішного є головним героєм твору',
        answers: [
          {
            text: 'Івана Багряного',
            correct: true
          },
          {
            text: 'Олександра Довженка'
          },
          {
            text: 'Валер’яна Підмогильного'
          },
          {
            text: 'Ліни Костенко'
          },
          {
            text: 'Григора Тютюнника'
          }
        ]
      }
    ]);
