import sizif from "../../img/sizif.png";

angular.module('llt.app')
    .constant('LITERATURE_1', [
      {
        question: 'Слова <em>"Гей поїхав Хмельницький ік Жовтому Броду"<em> є в',
        answers: [
          {
            text: 'думі'
          },
          {
            text: 'баладі'
          },
          {
            text: 'історичній пісні',
            correct: true
          },
          {
            text: 'родинно-побутовій пісні'
          },
          {
            text: 'соціально-побутовій пісні'
          }
        ]
      },
      {
        question: 'Епiзод зi "Слова про Ігорiв похiд" <br/><em>"Загула земля, зашумiла трава, вежi половецькi сколихнулися. А Ігор князь поскочив горностаєм в комишi і бiлим гоголем на воду. Упав на бистрого коня i скочив з нього сiрим вовком. I помчав до лугу Дiнця, і полетiв соколом пiд млою, забиваючи гусей і лебедiв"</em> змальовує',
        answers: [
          {
            text: 'поразку Ігоря в битвi'
          },
          {
            text: 'втечу Ігоря з полону',
            correct: true
          },
          {
            text: 'похiд Ігоря на половцiв'
          },
          {
            text: 'ночiвлю вiйська Ігоря в степу'
          },
          {
            text: 'допомогу сил природи князевi'
          }
        ]
      },
      {
        question: 'Перша пісня, яку виконує Наталка ("Наталка Полтавка" Івана Котляревського), – це',
        answers: [
          {
            text: '"Сонце низенько, вечір близенько..."'
          },
          {
            text: '"Віють вітри, віють буйні..."',
            correct: true
          },
          {
            text: '"Ой під вишнею, під черешнею..."'
          },
          {
            text: '"Всякому городу нрав і права..."'
          },
          {
            text: '"Гомін, гомін по діброві..."'
          }
        ]
      },
      {
        question: 'Образ Прометея символізує силу й нескореність народу у творі Тараса Шевченка',
        answers: [
          {
            text: '"Сон" ("У всякого своя доля...")'
          },
          {
            text: '"Кавказ"',
            correct: true
          },
          {
            text: '"Гайдамаки"'
          },
          {
            text: '"І мертвим, і живим..."'
          },
          {
            text: '"Ісаія. Глава 35"'
          }
        ]
      },
      {
        question: 'Кирило Тур, Іван Брюховецький, Яким Сомко є персонажами твору',
        answers: [
          {
            text: '"Чорна рада"',
            correct: true
          },
          {
            text: '"Маруся"'
          },
          {
            text: '"Хіба ревуть воли, як ясла повні?"'
          },
          {
            text: '"Камінний хрест"'
          },
          {
            text: '"Кайдашева сім’я"'
          }
        ]
      },
      {
        question: '<em>"Очевидна аналогія з українською нацією та її шляхом – шляхом не сорока років, а цілих століть, – до своєї свободи і державності"</em> простежується у творі',
        answers: [
          {
            text: '"Маруся Чурай"'
          },
          {
            text: '"Гайдамаки"'
          },
          {
            text: '"Чорна рада"'
          },
          {
            text: '"Мойсей"',
            correct: true
          },
          {
            text: '"Тіні забутих предків"'
          }
        ]
      },
      {
        question: 'На рисунку зображено персонажа античної міфології, образ якого переосмислено у творі',
        img: sizif,
        answers: [
          {
            text: '"Кавказ"'
          },
          {
            text: '"De libertate"'
          },
          {
            text: '"Гімн"'
          },
          {
            text: '"Contra spem spero!"',
            correct: true
          },
          {
            text: '"Молюсь і вірю"'
          }
        ]
      },
      {
        question: 'Батьковою настановою <em>"Тому роду нема переводу, в котрому браття милують згоду"</em> нехтують сини у творі',
        answers: [
          {
            text: '"Кайдашева сім’я"'
          },
          {
            text: '"Чорна рада"'
          },
          {
            text: '"Камінний хрест"'
          },
          {
            text: '"Вершники"',
            correct: true
          },
          {
            text: '"Україна в огні"'
          }
        ]
      },
      {
        question: 'Батьківщину, як і рідну матір, не обирають. Це провідна думка вірша',
        answers: [
          {
            text: '"Як добре те, що смерті не боюсь я"'
          },
          {
            text: '"Українське альфреско"'
          },
          {
            text: '"Лебеді материнства"',
            correct: true
          },
          {
            text: '"Блакитна Панна"'
          },
          {
            text: '"Молюсь і вірю..."'
          }
        ]
      },
      {
        question: 'У рядках <br/><br/><em>Йде весна<br/>Запашна,<br/>Квітами-перлами<br/>Закосичена</em><br/><br/>провідним художнім засобом є',
        answers: [
          {
            text: 'персоніфікація',
            correct: true
          },
          {
            text: 'паралелізм'
          },
          {
            text: 'анафора'
          },
          {
            text: 'оксиморон'
          },
          {
            text: 'порівняння'
          }
        ]
      },
      {
        question: 'Установіть відповідність між персонажами того самого твору.',
        table_titles: [
          {
            title: 'Персонаж'
          },
          {
            title: 'Персонаж'
          }
        ],
        table: [
          [
            {
              'column': 'Петро Шраменко'
            },
            {
              'column': 'дядько Лев'
            }
          ],
          [
            {
              'column': 'Мавка'
            },
            {
              'column': 'Уля Розсоха'
            }
          ],
          [
            {
              'column': 'Антоніо Пальма'
            },
            {
              'column': 'Леся Черевань'
            }
          ],
          [
            {
              'column': 'Мокій Мазайло'
            },
            {
              'column': 'Христя Хуторна'
            }
          ],
          [
            {
              'column': ''
            },
            {
              'column': 'Оверко Половець'
            }
          ]
        ],
        answers: [
          {
            text: '1',
            correct: '3'
          },
          {
            text: '2',
            correct: '1'
          },
          {
            text: '3',
            correct: '4'
          },
          {
            text: '4',
            correct: '2'
          }
        ]
      },
      {
        question: 'У рядку з календарно-обрядової пісні <em>"Що ж ти, нам, весно, принесла?"</em> використано',
        answers: [
          {
            text: 'персоніфікацію',
            correct: true
          },
          {
            text: 'постійний епітет'
          },
          {
            text: 'порівняння'
          },
          {
            text: 'гіперболу'
          },
          {
            text: 'оксиморон'
          }
        ]
      }
    ]);
