angular.module('llt.app')
    .constant('LITERATURE_1', [
      {
        question: 'Слова <span class="italic-inline">"Гей поїхав Хмельницький ік Жовтому Броду"</span> є в',
        answers: [
          {
            text: 'думі'
          },
          {
            text: 'баладі'
          },
          {
            text: 'історичній пісні',
            correct: true
          },
          {
            text: 'родинно-побутовій пісні'
          },
          {
            text: 'соціально-побутовій пісні'
          }
        ]
      },
      {
        question: 'Епiзод зi "Слова про Ігорiв похiд" <span class="italic">"Загула земля, зашумiла трава, вежi половецькi сколихнулися. А Ігор князь поскочив горностаєм в комишi і бiлим гоголем на воду. Упав на бистрого коня i скочив з нього сiрим вовком. I помчав до лугу Дiнця, і полетiв соколом пiд млою, забиваючи гусей і лебедiв"</span> змальовує',
        answers: [
          {
            text: 'поразку Ігоря в битвi'
          },
          {
            text: 'втечу Ігоря з полону',
            correct: true
          },
          {
            text: 'похiд Ігоря на половцiв'
          },
          {
            text: 'ночiвлю вiйська Ігоря в степу'
          },
          {
            text: 'допомогу сил природи князевi'
          }
        ]
      },
      {
        question: 'Перша пісня, яку виконує Наталка ("Наталка Полтавка" Івана Котляревського), – це',
        answers: [
          {
            text: '"Сонце низенько, вечір близенько..."'
          },
          {
            text: '"Віють вітри, віють буйні..."',
            correct: true
          },
          {
            text: '"Ой під вишнею, під черешнею..."'
          },
          {
            text: '"Всякому городу нрав і права..."'
          },
          {
            text: '"Гомін, гомін по діброві..."'
          }
        ]
      },
      {
        question: 'Образ Прометея символізує силу й нескореність народу у творі Тараса Шевченка',
        answers: [
          {
            text: '"Сон" ("У всякого своя доля...")'
          },
          {
            text: '"Кавказ"',
            correct: true
          },
          {
            text: '"Гайдамаки"'
          },
          {
            text: '"І мертвим, і живим..."'
          },
          {
            text: '"Ісаія. Глава 35"'
          }
        ]
      },
      {
        question: 'Кирило Тур, Іван Брюховецький, Яким Сомко є персонажами твору',
        answers: [
          {
            text: '"Чорна рада"',
            correct: true
          },
          {
            text: '"Маруся"'
          },
          {
            text: '"Хіба ревуть воли, як ясла повні?"'
          },
          {
            text: '"Камінний хрест"'
          },
          {
            text: '"Кайдашева сім’я"'
          }
        ]
      },
      {
        question: '<span class="italic-inline">"Очевидна аналогія з українською нацією та її шляхом – шляхом не сорока років, а цілих століть, – до своєї свободи і державності"</span> простежується у творі',
        answers: [
          {
            text: '"Маруся Чурай"'
          },
          {
            text: '"Гайдамаки"'
          },
          {
            text: '"Чорна рада"'
          },
          {
            text: '"Мойсей"',
            correct: true
          },
          {
            text: '"Тіні забутих предків"'
          }
        ]
      },
      {
        question: 'На рисунку зображено персонажа античної міфології, образ якого переосмислено у творі',
        img: 'src/img/sizif.png',
        answers: [
          {
            text: '"Кавказ"'
          },
          {
            text: '"De libertate"'
          },
          {
            text: '"Гімн"'
          },
          {
            text: '"Contra spem spero!"',
            correct: true
          },
          {
            text: '"Молюсь і вірю"'
          }
        ]
      },
      {
        question: 'Батьковою настановою <span class="italic-inline">"Тому роду нема переводу, в котрому браття милують згоду"</span> нехтують сини у творі',
        answers: [
          {
            text: '"Кайдашева сім’я"'
          },
          {
            text: '"Чорна рада"'
          },
          {
            text: '"Камінний хрест"'
          },
          {
            text: '"Вершники"',
            correct: true
          },
          {
            text: '"Україна в огні"'
          }
        ]
      },
      {
        question: 'Батьківщину, як і рідну матір, не обирають. Це провідна думка вірша',
        answers: [
          {
            text: '"Як добре те, що смерті не боюсь я"'
          },
          {
            text: '"Українське альфреско"'
          },
          {
            text: '"Лебеді материнства"',
            correct: true
          },
          {
            text: '"Блакитна Панна"'
          },
          {
            text: '"Молюсь і вірю..."'
          }
        ]
      },
      {
        question: 'У рядках <span class="italic-inline"><br/>Йде весна<br/>Запашна,<br/>Квітами-перлами<br/>Закосичена<br/></span>провідним художнім засобом є',
        answers: [
          {
            text: 'персоніфікація',
            correct: true
          },
          {
            text: 'паралелізм'
          },
          {
            text: 'анафора'
          },
          {
            text: 'оксиморон'
          },
          {
            text: 'порівняння'
          }
        ]
      },
      {
        question: 'Установіть відповідність між персонажами того самого твору.',
        table: true,
        table_titles: [
          {
            title_1: 'Персонаж',
          },
          {
            title_2: 'Персонаж'
          }
        ],
        variants_1: [
          {
            text: 'Петро Шраменко'
          },
          {
            text: 'Мавка'
          },
          {
            text: 'Антоніо Пальма'
          },
          {
            text: 'Мокій Мазайло'
          },
          {
            text: ''
          }
        ],
        variants_2: [
          {
            text: 'дядько Лев'
          },
          {
            text: 'Уля Розсоха'
          },
          {
            text: 'Леся Черевань'
          },
          {
            text: 'Христя Хуторна'
          },
          {
            text: 'Оверко Половець'
          }
        ],
        answers: [
          {
            text: '1',
            correct: 'c'
          },
          {
            text: '2',
            correct: 'a'
          },
          {
            text: '3',
            correct: 'd'
          },
          {
            text: '4',
            correct: 'b'
          }
        ]
      },
      {
        question: 'У рядку з календарно-обрядової пісні <span class="italic-inline">"Що ж ти, нам, весно, принесла?"</span> використано',
        answers: [
          {
            text: 'персоніфікацію',
            correct: true
          },
          {
            text: 'постійний епітет'
          },
          {
            text: 'порівняння'
          },
          {
            text: 'гіперболу'
          },
          {
            text: 'оксиморон'
          }
        ]
      }
    ]);
