angular.module('llt.app')
    .constant('LANGUAGE_MORFOLOGY_5', [
      {
        question: 'У якому із запропонованих варіантів усі три іменники належать до одного роду (чоловічого, жіночого або середнього)?',
        answers: [
          {
            text: 'юннат, міськком, Ілля',
            correct: true
          },
          {
            text: 'ПТУ, Вінниця, степ'
          },
          {
            text: 'озеро, УПА, загін'
          },
          {
            text: 'профком, Індія, Одеса'
          },
          {
            text: 'хор, Осло, воєвода'
          }
        ]
      },
      {
        question: 'Позначте рядок, у якому всі іменники належать до жіночого роду.',
        answers: [
          {
            text: 'мудрість, медаль, комаха, вежа, суміш',
            correct: true
          },
          {
            text: 'директор, барва, цінність, Сава, молодість'
          },
          {
            text: 'приблуда, співачка, Дарина, нива, круча'
          },
          {
            text: 'грудка, глибінь, краватка, преса, листоноша'
          },
          {
            text: 'тінь, бджола, акція, матуся, нерівня'
          }
        ]
      },
      {
        question: 'У якому варіанті всі іменники належать до першої відміни?',
        answers: [
          {
            text: 'гостина, людина, Микола',
            correct: true
          },
          {
            text: 'чашка, блюдце, книга'
          },
          {
            text: 'ложка, коробка, тунель<'
          },
          {
            text: 'вуаль, зал, мадам'
          },
          {
            text: 'смужка, круг, Олеся'
          }
        ]
      },
      {
        question: 'У якому варіанті всі іменники другої відміни в орудному відмінку однини мають закінчення -ем (-єм)?',
        answers: [
          {
            text: 'циркуль, саджанець, непалець, борець, навик'
          },
          {
            text: 'каганець, кисіль, нищитель, обрахунок, обранець'
          },
          {
            text: 'нікель, учитель, носоріг, обрізувач, Дихалець'
          },
          {
            text: 'коваль, тоннаж, Ігор, лосось, лобище',
            correct: true
          },
          {
            text: 'ніцшеанець, образ, оборонець, оберіг, Ємець'
          }
        ]
      },
      {
        question: 'У якому слові неправильно вжито закінчення кличного відмінка?',
        answers: [
          {
            text: 'Петре!'
          },
          {
            text: 'Ірине!',
            correct: true
          },
          {
            text: 'Леоніде!'
          },
          {
            text: 'друже!'
          },
          {
            text: 'сестро!'
          }
        ]
      },
      {
        question: 'У якому варіанті всі прикметники відносні?',
        answers: [
          {
            text: 'вовчий характер, вовче лігво, вовчий хвіст'
          },
          {
            text: 'прикордонний пост, малиновий напій, виховна година',
            correct: true
          },
          {
            text: 'Алтайські гори, вузька стежка, Андріїв зошит'
          },
          {
            text: 'материна хустка, пшеничні пампушки, жовтий цвіт'
          },
          {
            text: 'свіжий хліб, бадьора пісня, хвойний ліс'
          }
        ]
      },
      {
        question: 'Знайдіть помилку у поєднанні числівників з іменниками.',
        answers: [
          {
            text: 'до шістдесятиріччя поета'
          },
          {
            text: 'До шістдесятиліття ювіляра'
          },
          {
            text: 'сімдесятикілометровий заїзд'
          },
          {
            text: 'вісімдесятирічний дідуган'
          },
          {
            text: 'з п’ятидесятилітнім чоловіком',
            correct: true
          }
        ]
      },
      {
        question: 'У якому варіанті всі дієслова доконаного виду?',
        answers: [
          {
            text: 'розподілити, підвести, шукати, змалювати'
          },
          {
            text: 'асигнувати, стерти, вгадувати, з’єднати'
          },
          {
            text: 'стирати, згадати, позначити, окреслити'
          },
          {
            text: 'спрямувати, збігти, допекти, дійти',
            correct: true
          },
          {
            text: 'сформувати, обчислювати, завезти, крикнути'
          }
        ]
      },
      {
        question: 'У якому варіанті подані всі дієслова дійсного способу?',
        answers: [
          {
            text: 'їжте, з’їв би, їла, їли'
          },
          {
            text: 'з’їли б, їмо, з’їсть, з’їдять'
          },
          {
            text: 'їжмо, їдять, нехай поїсть, їсте'
          },
          {
            text: 'їжте, будуть їсти, їстимеш, хай їсть'
          },
          {
            text: 'їси, буду їсти, їстиму, з’їм',
            correct: true
          }
        ]
      },
      {
        question: 'У якому варіанті усі дієслівні форми належать до незмінних?',
        answers: [
          {
            text: 'зекономлено, економлячи, зекономивши, економити, зекономлений'
          },
          {
            text: 'прочитано, читати, читаний, читаючи, прочитавши'
          },
          {
            text: 'змарнувати, марнуючи, змарнувавши, змарнований, змарнував'
          },
          {
            text: 'опрацьовано, працюючи, працювати, опрацював, працюй'
          },
          {
            text: 'зрошено, зрошуючи, зросивши, зросити, зрошувати',
            correct: true
          }
        ]
      },
      {
        question: 'У якому варіанті правильно вжито прийменник з іменником?',
        answers: [
          {
            text: 'дізнатися по газетах'
          },
          {
            text: 'вжито заходів по вдосконаленню обліку'
          },
          {
            text: 'отримано близько сотні приладів',
            correct: true
          },
          {
            text: 'працювати по схемі'
          },
          {
            text: 'прийом по проханню'
          }
        ]
      },
      {
        question: 'У якому реченні частку НЕ треба писати з наступним словом окремо?',
        answers: [
          {
            text: 'А я не/раб, не/хитрий служка, чия натура, як подушка, податлива й м’яка (Д. Павличко).',
            correct: true
          },
          {
            text: 'Я буду на світі, допоки не/знане світло в обличчі твоєму світить (Д. Павличко).'
          },
          {
            text: 'Великим не/щастям для людини обертаються нищення природи, не/повага до неї (Г. Нудьга).'
          }
        ]
      }
    ]);
