angular.module('llt.app')
    .constant('LANGUAGE_MORFOLOGY_2', [
      {
        question: 'У якому із запропонованих варіантів усі три іменники належать до одного роду (чоловічого, жіночого або середнього)?',
        answers: [
          {
            text: 'Токіо, шимпанзе, стіл'
          },
          {
            text: 'Дніпро, батько, підпис',
            correct: true
          },
          {
            text: 'кисень, путь, стебло'
          },
          {
            text: 'аналог, Поділля, ТСН'
          },
          {
            text: 'поні, таксі, Житомир'
          }
        ]
      },
      {
        question: 'Позначте рядок, у якому всі іменники належать до жіночого роду.',
        answers: [
          {
            text: 'суддя, калина, сіль, вимова, горошина'
          },
          {
            text: 'сирота, казка, сталь, нехворощ, Світлана'
          },
          {
            text: 'воєвода, піч, Аліна, зброя, івасі'
          },
          {
            text: 'бухгалтер, мідь, алея, шабля, ерудиція'
          },
          {
            text: 'бухгалтерія, північ, вишня, салямі, Волинь',
            correct: true
          }
        ]
      },
      {
        question: 'У якому варіанті всі іменники належать до першої відміни?',
        answers: [
          {
            text: 'мишеня, надія, кишеня'
          },
          {
            text: 'угода, матуся, миша',
            correct: true
          },
          {
            text: 'груша, родич, родина'
          },
          {
            text: 'просо, група, бажання'
          },
          {
            text: 'пісня, надія, любов'
          }
        ]
      },
      {
        question: 'У якому варіанті всі іменники другої відміни в орудному відмінку однини мають закінчення -ем (-єм)?',
        answers: [
          {
            text: 'матч, плющ, дзенькіт, вокзал, вальс'
          },
          {
            text: 'грім, сум, кожух, гончар, шлях'
          },
          {
            text: 'тираж, розбій, плащ, кінь, герой',
            correct: true
          },
          {
            text: 'різьбяр, піддашшя, фартух, горішок, розділ'
          },
          {
            text: 'дзиґар, узбіччя, горіх, викрик, пояс'
          }
        ]
      },
      {
        question: 'У якому слові неправильно вжито закінчення кличного відмінка?',
        answers: [
          {
            text: 'Василю!'
          },
          {
            text: 'Наталіє!'
          },
          {
            text: 'Андріє!',
            correct: true
          },
          {
            text: 'колего!'
          },
          {
            text: 'слухачу!'
          }
        ]
      },
      {
        question: 'У якому варіанті всі прикметники відносні?',
        answers: [
          {
            text: 'Андріївський узвіз, вугільні комбайни, Василів брат'
          },
          {
            text: 'мметрологічна служба, післяобідній відпочинок, ніжний тон'
          },
          {
            text: 'круп’яний завод, кришталева совість, широка вулиця'
          },
          {
            text: 'хороший воїн, військова техніка, гречане борошно'
          },
          {
            text: 'вечірні новини, вступний іспит, нічний сон',
            correct: true
          }
        ]
      },
      {
        question: 'Знайдіть помилку у поєднанні числівників з іменниками.',
        answers: [
          {
            text: 'за чверть до дев’ятої'
          },
          {
            text: 'прийду в дев’ять',
            correct: true
          },
          {
            text: 'прийду о дев’ятій'
          },
          {
            text: 'за п’ять хвилин дев’ята'
          },
          {
            text: 'о пів на дев’яту'
          }
        ]
      },
      {
        question: 'У якому варіанті всі дієслова доконаного виду?',
        answers: [
          {
            text: 'примкнути, зшити, звірити, пригнути',
            correct: true
          },
          {
            text: 'ховатися, зрізати, замкнути, схитрувати'
          },
          {
            text: 'вимовити, закріпити, спроектувати, купувати'
          },
          {
            text: 'завести, зіграти, найняти, співати'
          },
          {
            text: 'наймати, купатися, вишивати, дивуватися'
          }
        ]
      },
      {
        question: 'У якому варіанті подані всі дієслова дійсного способу?',
        answers: [
          {
            text: 'перевір, перевірю, перевіряйте, перевірив би'
          },
          {
            text: 'перевіримо, перевірте, перевірила б, хай перевірить'
          },
          {
            text: 'перевіриш, перевіряю, перевірятимуть, перевіряв',
            correct: true
          },
          {
            text: 'нехай перевірять, перевірмо, перевірите, перевіряли'
          },
          {
            text: 'перевірить, будемо перевіряти, перевіримо, нехай перевіряють'
          }
        ]
      },
      {
        question: 'У якому варіанті усі дієслівні форми належать до незмінних?',
        answers: [
          {
            text: 'відкрито, відкриваючи, відкрити, відкривати, відкривши',
            correct: true
          },
          {
            text: 'зраджено, зраджувати, зраджений, зрадити, зрадиш'
          },
          {
            text: 'вирощено, вирощений, виростили, виростити, виростеш'
          },
          {
            text: 'знесено, знесений, зносити, зносячи, знісши'
          },
          {
            text: 'борючись, поборений, побороли, боротися, борються'
          }
        ]
      },
      {
        question: 'У якому варіанті правильно вжито прийменник з іменником?',
        answers: [
          {
            text: 'заняття з психології',
            correct: true
          },
          {
            text: 'підручник по педагогіці'
          },
          {
            text: 'по замовленню адвокатури'
          },
          {
            text: 'на наступний день'
          },
          {
            text: 'температура повітря біля нуля градусів'
          }
        ]
      },
      {
        question: 'У якому реченні частку НЕ треба писати з наступним словом окремо?',
        answers: [
          {
            text: 'Ще в школі, не/оперена пташина, дививсь я на сторінку букваря (Д.Луценко).'
          },
          {
            text: 'Не/має, ніж народ, мудріших вчителів (М. Рильський).'
          },
          {
            text: 'Нам не/страшні ворожі тучі і низьколоба клевета (М. Рильський).',
            correct: true
          }
        ]
      }
    ]);
