angular.module('llt.app')
    .constant('LANGUAGE_MORFOLOGY_3', [
      {
        question: 'У якому із запропонованих варіантів усі три іменники належать до одного роду (чоловічого, жіночого або середнього)?',
        answers: [
          {
            text: 'Делі, країна, просо'
          },
          {
            text: 'нарис, щастя, ВНЗ'
          },
          {
            text: 'земля, тунель, ательє'
          },
          {
            text: 'путь, доблесть, любов',
            correct: true
          },
          {
            text: 'Керч, річка, острів'
          }
        ]
      },
      {
        question: 'Позначте рядок, у якому всі іменники належать до жіночого роду.',
        answers: [
          {
            text: 'зоря, бездара, береза, Людмила, парта'
          },
          {
            text: 'битва, модель, річ, Нінель, Вірджинія',
            correct: true
          },
          {
            text: 'забіяка, груша, форма, пам’ять, криза'
          },
          {
            text: 'тюль, крига, Валентина, малолюдність, пара'
          },
          {
            text: 'путь, Надія, верф, радість, лікар'
          }
        ]
      },
      {
        question: 'У якому варіанті всі іменники належать до першої відміни?',
        answers: [
          {
            text: 'сани, кукурудза, теща'
          },
          {
            text: 'батько, річка, гора'
          },
          {
            text: 'кухар, майстриня, кухня'
          },
          {
            text: 'суддя, Ілля, Софія',
            correct: true
          },
          {
            text: 'професія, основа, мати'
          }
        ]
      },
      {
        question: 'У якому варіанті всі іменники другої відміни в орудному відмінку однини мають закінчення -ем (-єм)?',
        answers: [
          {
            text: 'узбережжя, мільйон, факт, санаторій, вуж'
          },
          {
            text: 'наріччя, видовище, вивих, друг, Камаз'
          },
          {
            text: 'мовлення, етап, викрут, алмаз, рій'
          },
          {
            text: 'пісняр, глядач, вимикач, іній, плач',
            correct: true
          },
          {
            text: 'командир, рік, стан, льон, покрій'
          }
        ]
      },
      {
        question: 'У якому слові неправильно вжито закінчення кличного відмінка?',
        answers: [
          {
            text: 'Артуре!'
          },
          {
            text: 'Фрідріху!'
          },
          {
            text: 'Зоє!'
          },
          {
            text: 'добродіє!',
            correct: true
          },
          {
            text: 'товаришу!'
          }
        ]
      },
      {
        question: 'У якому варіанті всі прикметники відносні?',
        answers: [
          {
            text: 'кам’яна статуя, кілометрова відстань, читальний зал',
            correct: true
          },
          {
            text: 'великий зал, обідня перерва, далека путь'
          },
          {
            text: 'останній випуск, нічний кінозал, сірі тони'
          },
          {
            text: 'кімнатна рослина, зелений овес, легкий підйом'
          },
          {
            text: 'польова кухня, гірське літо, прозорий тюль'
          }
        ]
      },
      {
        question: 'Знайдіть помилку у поєднанні числівників з іменниками.',
        answers: [
          {
            text: 'дві третіх кілометра'
          },
          {
            text: 'п’ять шостих квадрата'
          },
          {
            text: 'двома третіми площами',
            correct: true
          },
          {
            text: 'у п’яти сьомих будинку'
          },
          {
            text: 'однією другою години'
          }
        ]
      },
      {
        question: 'У якому варіанті всі дієслова доконаного виду?',
        answers: [
          {
            text: 'здивувати, повірити, вирішувати, прогнати'
          },
          {
            text: 'накивати, закласти, допити, допивати'
          },
          {
            text: 'причинити, скопати, розв’язати, приписати',
            correct: true
          },
          {
            text: 'закладати, танцювати, з’їсти, з’їхати'
          },
          {
            text: 'відвідати, клеїти, покластися, сподіватися'
          }
        ]
      },
      {
        question: 'У якому варіанті подані всі дієслова дійсного способу?',
        answers: [
          {
            text: 'спішіть, спішив, спішила, спішитиме',
            correct: true
          },
          {
            text: 'поспішайте, поспішила б, поспішіть, спішимо'
          },
          {
            text: 'спіши, хай спішить, будеш спішити, будуть спішити'
          },
          {
            text: 'спішите, спішать, поспішають, поспішатимуть'
          },
          {
            text: 'нехай спішать, спішиш, буде спішити, спішили'
          }
        ]
      },
      {
        question: 'У якому варіанті усі дієслівні форми належать до незмінних?',
        answers: [
          {
            text: 'висміяно, сміючись, висміяний, сміялися, сміятися'
          },
          {
            text: 'запрошено, запрошуючи, запросивши, запросити, запрошувати',
            correct: true
          },
          {
            text: 'оголошую, оголосити, оголошено, оголошуючи, оголосивши'
          },
          {
            text: 'скроєно, кроїти, скроєний, викроївши, викроїв'
          },
          {
            text: 'забувати, забуто, забув, забудьмо, не забудь'
          }
        ]
      },
      {
        question: 'У якому варіанті правильно вжито прийменник з іменником?',
        answers: [
          {
            text: 'іспит по математиці'
          },
          {
            text: 'зупинка по вимозі'
          },
          {
            text: 'заява за власним бажанням',
            correct: true
          },
          {
            text: 'по останній моді'
          },
          {
            text: 'згідно наказу'
          }
        ]
      },
      {
        question: 'У якому реченні частку НЕ треба писати з наступним словом окремо?',
        answers: [
          {
            text: 'Знову день, і знову не/веселий (Л. Дмитерко).'
          },
          {
            text: 'Як не/любити любов’ю наснажених, мудрістю сповнених книг? (М. Рильський).',
            correct: true
          },
          {
            text: 'Не/зважаючи на досить задерикуватий характер Маковея, всі його любили (О. Гончар).'
          }
        ]
      }
    ]);
