angular.module('llt.app')
    .constant('LANGUAGE_MORFOLOGY_1', [
      {
        question: 'У якому із запропонованих варіантів усі три іменники належать до одного роду (чоловічого, жіночого або середнього)?',
        answers: [
          {
            text: 'тополя, дріб, Київ'
          },
          {
            text: 'Тбілісі, ООН, листя'
          },
          {
            text: 'курча, вітрило, досьє',
            correct: true
          },
          {
            text: 'суддя, салямі, СНД'
          },
          {
            text: 'Міссісіпі, Капрі, дріб'
          }
        ]
      },
      {
        question: 'Позначте рядок, у якому всі іменники належать до жіночого роду.',
        answers: [
          {
            text: 'місія, Міссурі, далеч, Горинь, ООН',
            correct: true
          },
          {
            text: 'бездара, річ, тиша, Ольвія, держава'
          },
          {
            text: 'шампунь, Марія, стихія, Лідія, ніч'
          },
          {
            text: 'собака, Анастасія, любов, щирість, мати'
          },
          {
            text: 'путь, Надія, верф, радість, лікар'
          }
        ]
      },
      {
        question: 'У якому варіанті всі іменники належать до першої відміни?',
        answers: [
          {
            text: 'суддя, область, тесляр'
          },
          {
            text: 'бажання, кухня, струна'
          },
          {
            text: 'учительська, жінка, староста'
          },
          {
            text: 'легеня, сльоза, доня',
            correct: true
          },
          {
            text: 'весло, гості, пісня'
          }
        ]
      },
      {
        question: 'У якому варіанті всі іменники другої відміни в орудному відмінку однини мають закінчення -ем (-єм)?',
        answers: [
          {
            text: 'вітрище, вогнище, озеро, Київ, орел'
          },
          {
            text: 'ніж, кущ, вудлище, поле, вовчище',
            correct: true
          },
          {
            text: 'скопище, насіння, збіжжя, чай, тил'
          },
          {
            text: 'село, одяг, плюс, льодок, пейзаж'
          },
          {
            text: 'вогонь, пень, баран, м’яч, взуття'
          }
        ]
      },
      {
        question: 'У якому слові неправильно вжито закінчення кличного відмінка?',
        answers: [
          {
            text: 'Миколе!',
            correct: true
          },
          {
            text: 'Ганно!'
          },
          {
            text: 'пані!'
          },
          {
            text: 'панове!'
          },
          {
            text: 'пане!'
          }
        ]
      },
      {
        question: 'У якому варіанті всі прикметники відносні?',
        answers: [
          {
            text: 'Михайлівський собор, лисяча нора, батькова хата'
          },
          {
            text: 'директорів наказ, малиновий прапор, якісні вироби'
          },
          {
            text: 'Оксанин зошит, творчий порив, дрібний дощик'
          },
          {
            text: 'паперові квіти, молочна каша, різдвяні канікули',
            correct: true
          },
          {
            text: 'книжкова палата, вимірювальні прилади, холодний клімат'
          }
        ]
      },
      {
        question: 'Знайдіть помилку у поєднанні числівників з іменниками',
        answers: [
          {
            text: 'одна п’ята грамів',
            correct: true
          },
          {
            text: 'дві шостих кулі'
          },
          {
            text: 'перша година п’ять хвилин'
          },
          {
            text: 'за чверть восьма'
          },
          {
            text: 'о пів на першу'
          }
        ]
      },
      {
        question: 'У якому варіанті всі дієслова доконаного виду?',
        answers: [
          {
            text: 'зійти, купити, набрати, оцінити',
            correct: true
          },
          {
            text: 'доглянути, сходити, виховати, знаходитися'
          },
          {
            text: 'прикрасити, прагнути, вбачати, знаходитися'
          },
          {
            text: 'осучаснити, оновлювати, оздоровити, оббігти'
          },
          {
            text: 'обрати, забирати, доганяти, трудитисяs'
          }
        ]
      },
      {
        question: 'У якому варіанті подані всі дієслова дійсного способу?',
        answers: [
          {
            text: 'співаємо, співатиму, проспівав, співали',
            correct: true
          },
          {
            text: 'співаймо, хай заспіває, співайте, заспівали'
          },
          {
            text: 'співаєш, співав, співав би, співала'
          },
          {
            text: 'співали б, співаєте, співаю, заспівували'
          },
          {
            text: 'будеш співати, хай заспіває, співав би, співатиме'
          }
        ]
      },
      {
        question: 'У якому варіанті усі дієслівні форми належать до незмінних?',
        answers: [
          {
            text: 'вкрито, накриваючи, укривши, вкритий, вкрило'
          },
          {
            text: 'посіємо, посіяно, засіявши, сіючи, сіяний'
          },
          {
            text: 'записано, записавши, пишучи, писати, записувати',
            correct: true
          },
          {
            text: 'збито, битий, б’ючи, побивши, збиваючи'
          },
          {
            text: 'грати, зіграно, граючий, зігравши, грали'
          }
        ]
      },
      {
        question: 'У якому варіанті правильно вжито прийменник з іменником?',
        answers: [
          {
            text: 'вдарити кулаком по столу',
            correct: true
          },
          {
            text: 'консультація з хімії по четвергам'
          },
          {
            text: 'називати студента по імені'
          },
          {
            text: 'лекція по психології'
          },
          {
            text: 'по прикладу старших друзів'
          }
        ]
      },
      {
        question: 'У якому реченні частку НЕ треба писати з наступним словом окремо?',
        answers: [
          {
            text: 'Краю мій, краю зоряний! У бою ніким ти не/скорений (В. Сосюра).',
            correct: true
          },
          {
            text: 'Він ніс у своєму серці не/згасний запал до роботи (В. Кучер).'
          },
          {
            text: 'Життя було до мене не/вблаганне (Л .Костенко).'
          }
        ]
      }
    ]);
