angular.module('llt.app')
    .constant('LANGUAGE_MORFOLOGY_4', [
      {
        question: 'У якому із запропонованих варіантів усі три іменники належать до одного роду (чоловічого, жіночого або середнього)?',
        answers: [
          {
            text: 'Сочі, звір, шило'
          },
          {
            text: 'Мін’юст, держава, банк'
          },
          {
            text: 'ступінь, військо, спокій'
          },
          {
            text: 'загс, перо, вчення'
          },
          {
            text: 'зерно, знання, дівча',
            correct: true
          }
        ]
      },
      {
        question: 'Позначте рядок, у якому всі іменники належать до жіночого роду.',
        answers: [
          {
            text: 'пшениця, Сибір, лють, Юлія, пищаль'
          },
          {
            text: 'Наталка, насип, Любов, богиня, миля'
          },
          {
            text: 'путь, галузь, мігрень, кукурудза, висота',
            correct: true
          },
          {
            text: 'дріб, ознака, красуня, м’якість, людина'
          },
          {
            text: 'степінь, примха, твердість, боротьба, віддаль'
          }
        ]
      },
      {
        question: 'У якому варіанті всі іменники належать до першої відміни?',
        answers: [
          {
            text: 'мушка, теля, газета'
          },
          {
            text: 'ратуша, двері, колона'
          },
          {
            text: 'качка, каченя, підлога'
          },
          {
            text: 'рай, Раїса, окраїна'
          },
          {
            text: 'Настя, матуся, Юлія',
            correct: true
          }
        ]
      },
      {
        question: 'У якому варіанті всі іменники другої відміни в орудному відмінку однини мають закінчення -ем (-єм)?',
        answers: [
          {
            text: 'зілля, крій, джаз, безчинство, шум'
          },
          {
            text: 'поет, вірш, збірник, альманах, прилад'
          },
          {
            text: 'Заполяр’я, дим, вітер, директор, комбайн'
          },
          {
            text: 'Приазов’я, вітерець, трамвай, корпус, відбій'
          },
          {
            text: 'зброяр, міраж, митець, нуль, прибій',
            correct: true
          }
        ]
      },
      {
        question: 'У якому слові неправильно вжито закінчення кличного відмінка?',
        answers: [
          {
            text: 'Сергію!'
          },
          {
            text: 'Людвигу!'
          },
          {
            text: 'Софіє!'
          },
          {
            text: 'Дмитре!'
          },
          {
            text: 'Миките!',
            correct: true
          }
        ]
      },
      {
        question: 'У якому варіанті всі прикметники відносні?',
        answers: [
          {
            text: 'офісні меблі, корисні овочі, людські долі'
          },
          {
            text: 'гострі ножиці, загальні збори, тонка тканина'
          },
          {
            text: 'літрова пляшка, звітна доповідь, заводська площа',
            correct: true
          },
          {
            text: 'морський вітер, Маріїн син, ведмежа шуба'
          },
          {
            text: 'заяча шапка, заячі сліди, білий сніг'
          }
        ]
      },
      {
        question: 'Знайдіть помилку у поєднанні числівників з іменниками.',
        answers: [
          {
            text: 'одинадцята година дві хвилини'
          },
          {
            text: 'одинадцяте лютого'
          },
          {
            text: 'одна одинадцята карата'
          },
          {
            text: 'в одинадцять годин дві хвилини',
            correct: true
          },
          {
            text: 'одинадцять цілих п’ять десятих гектара'
          }
        ]
      },
      {
        question: 'У якому варіанті всі дієслова доконаного виду?',
        answers: [
          {
            text: 'надіятися, побрити, зашити, відвідувати'
          },
          {
            text: 'добувати, примножити, наскубти, надерти'
          },
          {
            text: 'вибити, роз’їжджати, вирвати, ділити'
          },
          {
            text: 'розграфити, підводити, піднести, прочитати'
          },
          {
            text: 'спитати, прибити, зібрати, направити',
            correct: true
          }
        ]
      },
      {
        question: 'У якому варіанті подані всі дієслова дійсного способу?',
        answers: [
          {
            text: 'несли, несуть, заніс, принесли',
            correct: true
          },
          {
            text: 'несіть, буде нести, занесе, заніс'
          },
          {
            text: 'несімо, нестиме, принесла б, принесіть'
          },
          {
            text: 'несіть, ніс би, принесемо, несуть'
          },
          {
            text: 'хай несе, несла б, носіть, носили'
          }
        ]
      },
      {
        question: 'У якому варіанті усі дієслівні форми належать до незмінних?',
        answers: [
          {
            text: 'опитати, опитуючи, опитані, опитано, опитавши'
          },
          {
            text: 'засновано, заснували, заснувати, засновувати, заснував'
          },
          {
            text: 'оспівано, оспівуючи, оспіваймо, оспівати, оспівувати'
          },
          {
            text: 'всипавши, всипано, всипати, висипаючи, висипати',
            correct: true
          },
          {
            text: 'преміювати, премійований, преміюючи, преміювали, преміювавши'
          }
        ]
      },
      {
        question: 'У якому варіанті правильно вжито прийменник з іменником?',
        answers: [
          {
            text: 'заступник декана по науковій роботі',
            correct: true
          },
          {
            text: 'завдання по фізиці'
          },
          {
            text: 'звільнився за власною волею'
          },
          {
            text: 'відповідно до наказу'
          },
          {
            text: 'взятися за роботу'
          }
        ]
      },
      {
        question: 'У якому реченні частку НЕ треба писати з наступним словом окремо?',
        answers: [
          {
            text: 'Прозора осене! Вертаєш ти не/допиті весни нам (М. Рильський).'
          },
          {
            text: 'Не/має меж у всесвіту, не/має. Є тільки простір, сяйво і пітьма (Л. Дмитерко).'
          },
          {
            text: 'Коли мені не/допоможуть вірші, то вже не/допоможуть лікарі (Д. Павличко).',
            correct: true
          }
        ]
      }
    ]);
