angular.module('llt.app')
    .constant('LANGUAGE_SYNTAX_5', [
      {
        question: 'Визначте тип словосполучення за способом вираження головного слова.<span class="italic">Швидко біг, заспівати пісню, принести сумку</span>',
        answers: [
          {
            text: 'іменникове'
          },
          {
            text: 'прикметникове'
          },
          {
            text: 'дієслівне',
            correct: true
          },
          {
            text: 'займенникове'
          },
          {
            text: 'прислівникове'
          }
        ]
      },
      {
        question: 'Яким членом речення є виділене слово?<span class="italic">Стародавнє місто Львів стало <strong>могутнім</strong> індустріальним центром (І. Цюпа)</span>',
        answers: [
          {
            text: 'підметом'
          },
          {
            text: 'присудком'
          },
          {
            text: 'означенням',
            correct: true
          },
          {
            text: 'додатком'
          },
          {
            text: 'обставиною'
          }
        ]
      },
      {
        question: 'З’ясуйте, у якому реченні невиправдано пропущено тире між підметом і присудком?',
        answers: [
          {
            text: 'Книга джерело знань.',
            correct: true
          },
          {
            text: 'Мовчи та мак товчи.'
          },
          {
            text: 'Вище лоба очі не ходять.'
          },
          {
            text: 'Гірко з’їсти, та жаль покинути.'
          },
          {
            text: 'На любов і смак товариш не всяк (З народної творчості).'
          }
        ]
      },
      {
        question: 'Визначте, чим ускладнене просте речення.<span class="italic">Чи то людина, чи вітерець, чи місяць золотою ручкою стукає в шибки (М. Стельмах).</span>',
        answers: [
          {
            text: 'однорідними членами речення',
            correct: true
          },
          {
            text: 'відокремленими членами речення'
          },
          {
            text: 'вставними конструкціями'
          },
          {
            text: 'звертаннями'
          }
        ]
      },
      {
        question: 'З’ясуйте умови відокремлення означення.<span class="italic">На чистому лобі були ніби намальовані веселі тонкі чорні брови, густі-прегусті (І. Нечуй-Левицький).</span>',
        answers: [
          {
            text: 'стоїть після означуваного слова, вираженого іменником',
            correct: true
          },
          {
            text: 'пояснює особовий займенник'
          },
          {
            text: 'стоїть перед означуваним іменником і має обставинний відтінок причини'
          }
        ]
      },
      {
        question: 'У якому реченні пропущено кому при відокремленій обставині?',
        answers: [
          {
            text: 'Хлопець, не прощаючись, у бої помчав (К. Герасименко).'
          },
          {
            text: 'Жовте листя, тремтячи і коливаючись у повітрі тихо сідало на землю (Б. Грінченко).',
            correct: true
          },
          {
            text: 'Рівнина поволі темнішала, укриваючись присмерком (П. Кочура).'
          }
        ]
      },
      {
        question: 'Яким є подане речення?<span class="italic">Я знаю: мова мамина – свята, в ній вічний, незнищенний дух свободи (М. Адаменко).</span>',
        answers: [
          {
            text: 'простим, ускладненим однорідними членами речення',
            correct: true
          },
          {
            text: 'складносурядним'
          },
          {
            text: 'складнопідрядним'
          },
          {
            text: 'простим, ускладненим відокремленими членами речення'
          },
          {
            text: 'безсполучниковим складним'
          }
        ]
      },
      {
        question: 'Вкажіть речення, у якому немає порушень норм сучасної української літературної мови.',
        answers: [
          {
            text: 'Різні міроприємства до Дня студента.'
          },
          {
            text: 'Розпочався курс лекцій по українській мові.'
          },
          {
            text: 'Дошка об’яв не вміщала усіх повідомлень.'
          },
          {
            text: 'Переказ грошей – одна з операцій поштових працівників.',
            correct: true
          },
          {
            text: 'Повістка дня зборів трудового колективу.'
          }
        ]
      },
      {
        question: 'У якому з наведених речень допущено стилістичну помилку?',
        answers: [
          {
            text: 'Ми живемо в одному будинку, але на різних поверхах.'
          },
          {
            text: 'Він знову мав чудову нагоду відвідати своїх батьків.'
          },
          {
            text: 'Однак усі ці аргументи не були прийняті до уваги.',
            correct: true
          }
        ]
      },
      {
        question: 'Яке із наведених словосполучень є неправильним?',
        answers: [
          {
            text: 'Світлове табло'
          },
          {
            text: 'Новий кафе-бар'
          },
          {
            text: 'Чорна толь',
            correct: true
          },
          {
            text: 'Модне жабо'
          },
          {
            text: 'Сучасне Токіо'
          }
        ]
      },
      {
        question: 'Яким членом речення є виділене слово?<span class="italic">Газета "Слово" опублікувала матеріали <strong>про святкування</strong> Дня учителя (З газети).</span>',
        answers: [
          {
            text: 'підметом'
          },
          {
            text: 'присудком'
          },
          {
            text: 'означенням',
            correct: true
          },
          {
            text: 'додатком'
          },
          {
            text: 'обставиною'
          }
        ]
      },
      {
        question: 'У якому варіанті правильно вжито прийменник з іменником?',
        answers: [
          {
            text: 'Знати по особистому досвіду.'
          },
          {
            text: 'Написав реферат з біології.',
            correct: true
          },
          {
            text: 'Доповідав на українській мові.'
          },
          {
            text: 'Підніматися по сходам.'
          },
          {
            text: 'По призначенню міністра.'
          }
        ]
      }
    ]);
