angular.module('llt.app')
    .constant('LANGUAGE_SYNTAX_2', [
      {
        question: 'Визначте тип словосполучення за способом вираження головного слова.<br/><em>Бажання читати, зелене листя, моя матір<br/><em>',
        answers: [
          {
            text: 'іменникове',
            correct: true
          },
          {
            text: 'прикметникове'
          },
          {
            text: 'дієслівне'
          },
          {
            text: 'займенникове'
          },
          {
            text: 'прислівникове'
          }
        ]
      },
      {
        question: 'Яким членом речення є виділене слово?<br/><em>Вогник спочатку спокійно мерехтів крізь туман, а потім <strong>почав креслити</strong> короткі круги (О. Донченко).<br/><em>',
        answers: [
          {
            text: 'підметом'
          },
          {
            text: 'присудком',
            correct: true
          },
          {
            text: 'означенням'
          },
          {
            text: 'додатком'
          },
          {
            text: 'обставиною'
          }
        ]
      },
      {
        question: 'З’ясуйте, у якому реченні невиправдано пропущено тире між підметом і присудком?',
        answers: [
          {
            text: 'Не на користь читать, коли тільки вершки хапать.'
          },
          {
            text: 'Хто хоче більше знати, треба менше спати.'
          },
          {
            text: 'Не бійся розумного ворога, а бійся дурного приятеля.'
          },
          {
            text: 'Коли б той розум наперед, що потім.'
          },
          {
            text: 'Вчення світ, а невчення тьма (З народної творчості).',
            correct: true
          }
        ]
      },
      {
        question: 'Визначте, чим ускладнене просте речення.<br/><em>Сергієві, незважаючи на веселий вечір, стало журно (В. Козаченко).<br/><em>',
        answers: [
          {
            text: 'однорідними членами речення'
          },
          {
            text: 'відокремленими членами речення',
            correct: true
          },
          {
            text: 'вставними конструкціями'
          },
          {
            text: 'звертаннями'
          }
        ]
      },
      {
        question: 'З’ясуйте умови відокремлення означення.<br/><em>Жорстока невблаганна і лукава, вона була як мачуха мені (Л. Костенко).<br/><em>',
        answers: [
          {
            text: 'стоїть після означуваного слова, вираженого іменником'
          },
          {
            text: 'пояснює особовий займенник',
            correct: true
          },
          {
            text: 'стоїть перед означуваним іменником і має обставинний відтінок причини'
          }
        ]
      },
      {
        question: 'У якому реченні пропущено кому при відокремленій обставині?',
        answers: [
          {
            text: 'Біліє лілея, ваблячи своєю дивовижною чистотою (О. Гончар).'
          },
          {
            text: 'Гнат, посміхаючись, став біля порога схвально придивляючись до постаті і свіжого обличчя молодиці (М. Стельмах).',
            correct: true
          },
          {
            text: 'Мати спить, над колискою сина схилившись (Леся Українка).'
          }
        ]
      },
      {
        question: 'Яким є подане речення?<br/><em>Самій недовго збитися з путі, та трудно з неї збитися в гурті (Леся Українка).<br/><em>',
        answers: [
          {
            text: 'простим, ускладненим однорідними членами речення'
          },
          {
            text: 'складносурядним',
            correct: true
          },
          {
            text: 'складнопідрядним'
          },
          {
            text: 'простим, ускладненим відокремленими членами речення'
          },
          {
            text: 'безсполучниковим складним'
          }
        ]
      },
      {
        question: 'Вкажіть речення, у якому немає порушень норм сучасної української літературної мови.',
        answers: [
          {
            text: 'Обсяг надходжень перевершив сподівання.',
            correct: true
          },
          {
            text: 'Підручники видано Євгену Бойко.'
          },
          {
            text: 'Станція працює круглодобово.'
          },
          {
            text: 'Оголошення по набору на курси.'
          },
          {
            text: 'Приймав участь у презентації книжки.'
          }
        ]
      },
      {
        question: 'У якому з наведених речень допущено стилістичну помилку?',
        answers: [
          {
            text: 'З вулиці доносилися крики людських голосів.',
            correct: true
          },
          {
            text: 'Конструктори заводу отримали премії.'
          },
          {
            text: 'Завдання, поставлене перед колективом, було успішно виконане.'
          }
        ]
      },
      {
        question: 'Яке із наведених словосполучень є неправильним?',
        answers: [
          {
            text: 'Легка тюль',
            correct: true
          },
          {
            text: 'Вовняне кашне'
          },
          {
            text: 'Гостинне Батумі'
          },
          {
            text: 'Нове авто'
          },
          {
            text: 'Незвичайне амплуа'
          }
        ]
      },
      {
        question: 'Яким членом речення є виділене слово?<br/><em>Незмовкаюче в темряві <strong>"ура"</strong> підіймалося дедалі вище, охоплюючи вершини (О. Гончар).<br/><em>',
        answers: [
          {
            text: 'підметом',
            correct: true
          },
          {
            text: 'присудком'
          },
          {
            text: 'означенням'
          },
          {
            text: 'додатком'
          },
          {
            text: 'обставиною'
          }
        ]
      },
      {
        question: 'У якому варіанті правильно вжито прийменник з іменником?',
        answers: [
          {
            text: 'Агент по постачанню.'
          },
          {
            text: 'Інспектор по техніці безпеки.'
          },
          {
            text: 'Ударити по м’ячу.',
            correct: true
          },
          {
            text: 'Чемпіон по тенісу.'
          },
          {
            text: 'Великий по обсягу.'
          }
        ]
      }
    ]);
